# Projeto em Grupo – Analisando os Dados do Titanic

## Objetivo

Explorar e analisar o conjunto de dados do Titanic utilizando as bibliotecas Pandas e NumPy, desenvolvendo habilidades práticas de manipulação e interpretação de dados.

## Formação dos Grupos
* Até 4 alunos por grupo.
* Cada grupo deve dividir as tarefas: leitura dos dados, tratamento, análise e apresentação.

## Etapas do Projeto

## 1. Exploração Inicial
* Carregar a planilha train.csv no Pandas;
* Visualizar as primeiras linhas (head) e verificar as colunas disponíveis;
* Identificar valores ausentes (.isnull().sum()).

In [1]:
import pandas as pd
import numpy as np

In [2]:
dataframe = pd.read_csv('data/train.csv')
dataframe.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [5]:
dataframe.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
dataframe.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## 2. Perguntas de Análise
1. Qual a porcentagem de sobreviventes no Titanic?
2. Houve diferença na taxa de sobrevivência entre homens e mulheres?
3. Passageiros de classes diferentes (Pclass) tiveram chances diferentes de sobrevivência?
4. Qual foi a média de idade dos sobreviventes e não sobreviventes?
5. Qual porto de embarque (Embarked) teve mais passageiros?

In [8]:
survivors_percent = dataframe['Survived'].mean() * 100
print(f'Porcentagem de sobreviventes: {survivors_percent:.2f}')

Porcentagem de sobreviventes: 38.38

In [17]:
sex_survivors = dataframe.groupby('Sex')['Survived'].mean() * 100
survivors_percent_groupBy_class = pd.DataFrame({
    'Sexo': sex_survivors.index,
    'Taxa de Sobrevivência (%)': sex_survivors.values.round(2) 
})
survivors_percent_groupBy_class['Sexo'] = survivors_percent_groupBy_class['Sexo'].replace({'male': 'masculino', 'female': 'feminino'})

print(survivors_percent_groupBy_class.to_string(index=False))

     Sexo  Taxa de Sobrevivência (%)
 feminino                      74.20
masculino                      18.89

In [ ]:
pclass_survivors = dataframe.groupby('Pclass')['Survived'].mean() * 100
survivors_percent_groupBy_class = pd.DataFrame({
    'Classe': pclass_survivors.index,
    'Taxa de Sobrevivência (%)': pclass_survivors.values.round(2)
})

print(survivors_percent_groupBy_class.to_string(index=False))

 Classe  Taxa de Sobrevivência (%)
      1                      62.96
      2                      47.28
      3                      24.24

In [ ]:
ages_mean_survivors = dataframe.groupby('Survived')['Age'].mean()
ages_mean_survivors_df = pd.DataFrame({
    'Sobreviveu': ages_mean_survivors.index,
    'Média de Idade': ages_mean_survivors.values.round(0)
})

ages_mean_survivors_df['Sobreviveu'] = ages_mean_survivors_df['Sobreviveu'].replace({0:'Faleceu', 1:'Sobreviveu'})

print(ages_mean_survivors_df.to_string(index=False))

Sobreviveu  Média de Idade
   Faleceu            31.0
Sobreviveu            28.0

In [42]:
embarked_sum = dataframe.groupby('Embarked').size()
embarked_sum_df = pd.DataFrame({
    'Local Do Embarque': embarked_sum.index,
    'Total de Embarques': embarked_sum.values
})
embarked_sum_df['Local Do Embarque'] = embarked_sum_df['Local Do Embarque'].replace(
    {
        'C':'Cherbourg - França', 
        'S':'Southampton - Inglaterra', 
        'Q':'Queenstown - Irlanda'
    })
print(embarked_sum_df.to_string(index=False))
print('------------------------------------------------')
print(f'Local que recebeu mais embarques no Titanic: {embarked_sum_df['Local Do Embarque'].max()}')
print(embarked_sum_df.max())

       Local Do Embarque  Total de Embarques
      Cherbourg - França                 168
    Queenstown - Irlanda                  77
Southampton - Inglaterra                 644
------------------------------------------------
Local que recebeu mais embarques no Titanic: Southampton - Inglaterra
Local Do Embarque     Southampton - Inglaterra
Total de Embarques                         644
dtype: object